DICTIONARY IN DATA STRUCTURES

In [32]:
d1={'id':1,'name':'john','age':18}

In [33]:
d1

{'id': 1, 'name': 'john', 'age': 18}

In [34]:
d1.keys()

dict_keys(['id', 'name', 'age'])

In [35]:
d1.values()

dict_values([1, 'john', 18])

In [36]:
d1.items()

dict_items([('id', 1), ('name', 'john'), ('age', 18)])

In [37]:
d1['id']

1

In [38]:
d1['name']

'john'

In [39]:
d1['age']

18

In [40]:
d1['age']=37

In [41]:
d1

{'id': 1, 'name': 'john', 'age': 37}

In [42]:
print("name shreya")

name shreya

In [43]:
print('shreya patel')

shreya patel

In [44]:
d1={'mobile':'apple'}

In [45]:
d1

{'mobile': 'apple'}

loop

In [46]:
i=0
while(i<5):
    print(i)
    i=i+1

0
1
2
3
4

In [47]:
i=3
while(i<20):
    print(i)
    i=i+2

3
5
7
9
11
13
15
17
19

In [48]:
i=1
while(i<30):
    print('i=',i)
    i=i+3

i= 1
i= 4
i= 7
i= 10
i= 13
i= 16
i= 19
i= 22
i= 25
i= 28

In [49]:
print("helo python")

helo python

In [50]:
print('hello python')

hello python

In [51]:
'''learning python basic comands of using loops 
they are for loop and while lopp'''

'learning python basic comands of using loops \nthey are for loop and while lopp'

In [52]:
for index in [1,2,3]:
    print(index)

1
2
3

In [53]:
for index in [10,20,30,30,40,50]:
    print(index)

10
20
30
30
40
50

In [54]:
for p in ['apple','mango','banana','orange']:
    print(p)

apple
mango
banana
orange

In [55]:
for a in[1,2,3,4]:
    print(a)

1
2
3
4

In [56]:
i=1
while(i<10):
    print(2*9)
    i=i+1

18
18
18
18
18
18
18
18
18

In [57]:
i=1
while(i<10):
    print('2*',i,"=",2*i)
    i=i+1

2* 1 = 2
2* 2 = 4
2* 3 = 6
2* 4 = 8
2* 5 = 10
2* 6 = 12
2* 7 = 14
2* 8 = 16
2* 9 = 18

In [58]:
i=1
j=int(input("enter any number for table generation"))
while(i<=10):
    print(j,"*",i,"=",j*i)
    i=i+1

52 * 1 = 52
52 * 2 = 104
52 * 3 = 156
52 * 4 = 208
52 * 5 = 260
52 * 6 = 312
52 * 7 = 364
52 * 8 = 416
52 * 9 = 468
52 * 10 = 520

In [59]:
for i in range (10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [60]:
list(range(2,10))

[2, 3, 4, 5, 6, 7, 8, 9]

In [61]:
for shreya in range(2,20):
    print(shreya)

2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [62]:
marks=85
if(marks>50):
    print('good')
else:
    print('average')

good

In [64]:
marks=int(input("enter any marks"))
if(marks>90):
    print("excellent")
elif(marks>80 and marks<=90):
    print("very good")
elif (marks>70 and marks<=80):
    print("good")
elif(marks>60 and marks<=70):
    print("average")
else:
     print("below average")

below average

list comprehension

In [65]:
a=[i for i in[1,2,3]]

In [66]:
a

[1, 2, 3]

In [67]:
b=[p for p in[10,20,30]]

In [68]:
b

[10, 20, 30]

In [69]:
k=[i for i in [2,3,4,5,6]if i%2==0]

In [70]:
k

[2, 4, 6]

In [71]:
b=[k for k in range (1,20)if k%2==0]
b

[2, 4, 6, 8, 10, 12, 14, 16, 18]

# string function

In [ ]:
word1="python"

In [ ]:
word1

'python'

In [ ]:
word1.upper()

'PYTHON'

In [73]:
word2="apple"

In [74]:
word2

'apple'

In [75]:
word2.lower()

'apple'

In [ ]:
word3="swpease"

In [ ]:
word3

In [ ]:
word4="my name is shreya patel"

In [ ]:
word4.title()

In [ ]:
word4.split()

In [ ]:
for i in ['apple','mango','papaya','orange','grapes']:
    print(i)

In [ ]:
for i in ['apple','mango','papaya','orange','grapes']:
    if i=='orange':
        break
    print(i)

FUNCTION

In [ ]:
#Function definition

def function1():
    print("Hello Function1")

In [ ]:
#calling function

function1()

In [ ]:
def myfunction():
    print("working in my function")

In [ ]:
myfunction()

In [ ]:
def addfunction():
    a=10
    b=5
    c=a+b
    print("the addition is c=",c)

In [ ]:
addfunction()

the addition is c= 15

In [ ]:
def multifunction():
    a=10
    b=8
    c=a*b
    print("the multipication=",c)

In [ ]:
multifunction()

the multipication= 80

In [ ]:
def Subtraction_function():
    x=90
    y=7
    z=x-y

In [ ]:
print("subtraction_function=")

subtraction_function=

In [ ]:
def area_of_rectangle():
    length=215
    breadth=6
    area=length*breadth
    print("the area of rectangle=",area)

In [ ]:
area_of_rectangle()

the area of rectangle= 1290

In [ ]:
def areaofrectangle():
    length=int(input("enter any length"))
    breadth=int(input("enter any breadth"))
    area=length*breadth
    print("area of rectangle=",area)

In [ ]:
areaofrectangle()

In [ ]:
def mypower_func():
    p=int(input("enter any number as a base"))
    q=int(input("enter any number as a power"))
    print("the result is",(p**q))

In [ ]:
mypower_func()

Parametric Function

In [ ]:
def multi_f(x,y):
    z=x*y
    print("z=",z)

In [ ]:
multi_f(4,9)

 variable number of arguments.....*

In [ ]:
def myaddition(*args):
    print(sum(args))

In [ ]:
myaddition(7,2)

In [ ]:
myaddition(2,8,3)

In [ ]:
def tablefunc():
    t=int(input("enter any number for table to be generated"))
    for i in range(1,11):
        print(t,'*',i,"=",t*i)
        
tablefunc()

enter any number for table to be generated78
78 * 1 = 78
78 * 2 = 156
78 * 3 = 234
78 * 4 = 312
78 * 5 = 390
78 * 6 = 468
78 * 7 = 546
78 * 8 = 624
78 * 9 = 702
78 * 10 = 780

In [ ]:
list1=[10,20,30]
list(map(lambda a:a+2,list1))

[12, 22, 32]

In [ ]:
list2=[1,2,3,4,5,6,7,8,9,10]
list(map(lambda p:p*5,list2))

In [ ]:
list3=[5,10,12,45,80]

In [ ]:
list(map(lambda radius:3.14*(radius**2),list3))

In [ ]:
list4=[2,3,4,5,6,7,8]

list(map(lambda t:t**2,list4))

[4, 9, 16, 25, 36, 49, 64]

FILTER IN LAMBDA

In [ ]:
list6=[1,2,3,4,5,6,7,8,9,10]

In [ ]:
d=list(filter(lambda x:x>5,list6))
d

[6, 7, 8, 9, 10]

In [ ]:
 list(filter(lambda p:p%2!=0,list6))

[1, 3, 5, 7, 9]

OOPS(object orinted programming)

In [ ]:
class student:
    #initialization constructor
    def __init__(self,sid,name,age):
        self.sid=sid
        self.name=name
        self.age=age
        
    def display(self):
        print("student id=",self.sid,"name =",self.name,"age =",self.age)

In [ ]:
#making object/instance           

s1=student(100,'david',14)
s1.display()

student id= 100 name = david age = 14

In [ ]:
s2=student(100,'smith',12)
s2.display()

In [ ]:
s1.name

'david'

In [ ]:
s1.age

14

In [ ]:
s2.name

'smith'

In [ ]:
s2.age

12

In [ ]:
s1.sid

100

GLOBAL VARIABLE

In [ ]:
 x=10

In [ ]:
x

10

In [ ]:
def func():
    print(x)

In [ ]:
func()

10

In [ ]:
x

10

In [ ]:
 def func():
    print(x)
    p=200#local variables
    print(p)

In [ ]:
func()

10
200

   RETURN KEYWORD

In [ ]:
 def addfunc():
        a=10
        b=5
        c=a+b
        print("c=",c)

In [ ]:
addfunc()

c= 15

In [ ]:
 def addfunc():
        a=10
        b=5
        c=a+b
        return c

In [ ]:
retval=addfunc()

In [ ]:
retval

15

In [ ]:
m=retval**2
m

225

In [ ]:
def inner_function():
    p=5
    print(p**2)

In [ ]:
def outer_function():
    inner_function()
    print("outer function")

In [ ]:
outer_function()

25
outer function

In [ ]:
def testf():
    m=int(input("enter any number"))
    print("square=",m**2)

In [ ]:
testf()

enter any number45
square= 2025

In [ ]:
a=10

In [ ]:
a=a+2

In [ ]:
a

12

In [ ]:
a=10

In [ ]:
n=int(input("enter number"))

enter number4

In [ ]:
a+=n

In [ ]:
a

14

In [ ]:
def sumfunc(*numbers):
    s=0
    for n in numbers:
        s+=n
    return s

In [ ]:
print(sumfunc(1,2))

3

In [ ]:
print(sumfunc(1,2,3))

6

In [ ]:
print(sumfunc(1,2,3,4))

10

LAMBDA FUNCTION ANONYMOUS

In [ ]:
test1=lambda x:x+1

In [ ]:
test1(2)

3

In [ ]:
test1(5)

6

In [ ]:
test2=lambda x:x+5

In [ ]:
test2(4)

9

In [ ]:
square=lambda s:s**2

In [ ]:
square(2)

4

In [ ]:
square(45)

2025

In [ ]:
mult=lambda k:k*2

In [ ]:
mult(6)

12

In [ ]:
mult(7)

14

In [ ]:
mult=lambda k,t:k*t

In [ ]:
mult(78,4)

312

In [ ]:
mult(89,8)

712

In [ ]:
addtest=lambda x,y,z:x+y+z

In [ ]:
addtest(3,10,5)

18

In [ ]:
sqroot=lambda x:x**(1/2)

In [ ]:
sqroot(55)

7.416198487095663

In [ ]:
area=lambda radius:3.14*(radius**2)

In [ ]:
area(6)

113.04

In [ ]:
area(89)

24871.940000000002

In [ ]:
arearect=lambda length,breadth:length*breadth

In [ ]:
arearect(89,56)

4984

In [ ]:
a=10

In [ ]:
b=78

In [ ]:
print(a+b)

156

In [ ]:
     def __init__(self, realpart, imagpart):
        self.r = realpart
        self.i = imagpart
        x = Complex(3.0, -4.5)
        x.r
        x.i

PANDA

DATA STRUCTURES NULLS//GROUPBY

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
ser = pd.Series()

ser
#print('{}\n'.format(ser))

C:\Users\paksh\AppData\Local\Temp\ipykernel_6276\3792949983.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()

Series([], dtype: float64)

In [ ]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [ ]:
ser=pd.Series([20,15.7,'10'])
ser

0      20
1    15.7
2      10
dtype: object

In [ ]:
dict={'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [ ]:
df=pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [ ]:
df['states']="CA NV AZ".split()

In [ ]:
df

   A  B  C states
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [ ]:
dict={'A':[1.0,2.5,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [ ]:
df=pd.DataFrame(dict)
df

     A    B  C
0  1.0  5.0  1
1  2.5  NaN  2
2  NaN  NaN  3

In [ ]:
df['D']=[20,30,40]
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.5  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
print("\nDropping any column with a NaN value\n",'-'*35,sep='')
print(df.dropna(axis=1))

Dropping any column with a NaN value
-----------------------------------
   C   D
0  1  20
1  2  30
2  3  40

In [ ]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.5  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
print("\nDropping any rows with a NaN value\n",'-'*35,sep='')
print(df.dropna(axis=0))

Dropping any rows with a NaN value
-----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [ ]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.5  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
print("\nFilling values with a defult value\n",'-'*35,sep='')
print(df.fillna(value=50))

Filling values with a defult value
-----------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.5  50.0  2  30
2  50.0  50.0  3  40

In [ ]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.5  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
print("\nFilling values with a computed value(mean of column A here)\n",'-'*60,sep='')
print(df.fillna(value=df['C'].mean(),inplace=True))

Filling values with a computed value(mean of column A here)
------------------------------------------------------------
None

In [ ]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.5  2.0  2  30
2  2.0  2.0  3  40

In [ ]:
data={'company':['goog','goog','msft','fb','fb'],
     'person':['shreya','sam','aksh','asha','pramod',],
     'sales':[200,120,240,450,785]}
df=pd.DataFrame(data)
df

  company  person  sales
0    goog  shreya    200
1    goog     sam    120
2    msft    aksh    240
3      fb    asha    450
4      fb  pramod    785

In [ ]:
bycomp=df.groupby('company')
print("\ngrouping by 'company column listing mean sales\n",'-'*55,sep='')
print(bycomp.mean())

grouping by 'company column listing mean sales
-------------------------------------------------------
         sales
company
fb       617.5
goog     160.0
msft     240.0

In [ ]:
print("\ngrouping by 'company column listing sum sales\n",'-'*55,sep='')
print(bycomp.sum())

grouping by 'company column listing sum sales
-------------------------------------------------------
         sales
company
fb        1235
goog       320
msft       240

CONCATING DATAFRAMES

In [ ]:
df1=pd.DataFrame({'mat':[40,50,60,70],
                 'eng':[11,77,88,99],
                 'sci':[78,45,12,52],
                 'chem':[26,89,36,89]},
                index=['diya','riya','shyam','kana'])
df1

       mat  eng  sci  chem
diya    40   11   78    26
riya    50   77   45    89
shyam   60   88   12    36
kana    70   99   52    89

In [ ]:
df2=pd.DataFrame({'mat':[11,22,33,44],
                 'eng':[66,87,34,66],
                 'sci':[81,87,59,85],
                 'chem':[26,89,36,89]},
                index=['miya','bivi','raji','sis'])
df2

      mat  eng  sci  chem
miya   11   66   81    26
bivi   22   87   87    89
raji   33   34   59    36
sis    44   66   85    89

In [ ]:
df_cat1=pd.concat([df1,df2],axis=0)
print("\nafter concatenation along row\n",'-'*30,sep='')
print(df_cat1)

after concatenation along row
------------------------------
       mat  eng  sci  chem
diya    40   11   78    26
riya    50   77   45    89
shyam   60   88   12    36
kana    70   99   52    89
miya    11   66   81    26
bivi    22   87   87    89
raji    33   34   59    36
sis     44   66   85    89

In [ ]:
df_cat2=pd.concat([df1,df2],axis=1)
print("\nafter concatenation along column\n",'-'*60,sep='')
print(df_cat2)

after concatenation along column
------------------------------------------------------------
        mat   eng   sci  chem   mat   eng   sci  chem
diya   40.0  11.0  78.0  26.0   NaN   NaN   NaN   NaN
riya   50.0  77.0  45.0  89.0   NaN   NaN   NaN   NaN
shyam  60.0  88.0  12.0  36.0   NaN   NaN   NaN   NaN
kana   70.0  99.0  52.0  89.0   NaN   NaN   NaN   NaN
miya    NaN   NaN   NaN   NaN  11.0  66.0  81.0  26.0
bivi    NaN   NaN   NaN   NaN  22.0  87.0  87.0  89.0
raji    NaN   NaN   NaN   NaN  33.0  34.0  59.0  36.0
sis     NaN   NaN   NaN   NaN  44.0  66.0  85.0  89.0

In [ ]:
df_cat2.fillna(value=0,inplace=True)
df_cat2

        mat   eng   sci  chem   mat   eng   sci  chem
diya   40.0  11.0  78.0  26.0   0.0   0.0   0.0   0.0
riya   50.0  77.0  45.0  89.0   0.0   0.0   0.0   0.0
shyam  60.0  88.0  12.0  36.0   0.0   0.0   0.0   0.0
kana   70.0  99.0  52.0  89.0   0.0   0.0   0.0   0.0
miya    0.0   0.0   0.0   0.0  11.0  66.0  81.0  26.0
bivi    0.0   0.0   0.0   0.0  22.0  87.0  87.0  89.0
raji    0.0   0.0   0.0   0.0  33.0  34.0  59.0  36.0
sis     0.0   0.0   0.0   0.0  44.0  66.0  85.0  89.0

In [ ]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3',],
                   'B':['B0','B1','B2','B3',]})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3',],
                   'D':['D0','D1','D2','D3',]})

In [ ]:
print("\nThe DataFrame 'left'\n",'-'*30,sep='')
print(left)

The DataFrame 'left'
------------------------------
  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
print("\nThe DataFrame 'right'\n",'-'*30,sep='')
print(right)

The DataFrame 'right'
------------------------------
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [ ]:
merge1=pd.merge(left,right,how='inner',on='key')
print("\nAfter simple merging with 'inner' method\n",'-'*50,sep='')
print(merge1)

After simple merging with 'inner' method
--------------------------------------------------
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])
                   
right=pd.DataFrame({'C':['C0','C2','C3'],
                    'D':['D0','D2','D3']},
                   index=['K0','K2','K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

DATA MAINPULATION

In [ ]:
def salary_hike(x):
    if (x > 3000):
        return np.ceil(x+(x*.30))
    else:
        return np.ceil(x*1.5)

In [ ]:
df=pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                'Emp_name':['raju','kanu','seju','papu','sanju','salu','ashu','akshay','monu','motu'],
                'Salary':[1111,2222,3333,4444,5555,6666,7777,8888,9999,10000]})
df

   Dept Emp_name  Salary
0     1     raju    1111
1     2     kanu    2222
2     3     seju    3333
3     4     papu    4444
4     5    sanju    5555
5     6     salu    6666
6     7     ashu    7777
7     8   akshay    8888
8     9     monu    9999
9    10     motu   10000

In [ ]:
df['New_Salary']=df['Salary'].apply(salary_hike)
print(df)

   Dept Emp_name  Salary  New_Salary
0     1     raju    1111      1667.0
1     2     kanu    2222      3333.0
2     3     seju    3333      4333.0
3     4     papu    4444      5778.0
4     5    sanju    5555      7222.0
5     6     salu    6666      8666.0
6     7     ashu    7777     10111.0
7     8   akshay    8888     11555.0
8     9     monu    9999     12999.0
9    10     motu   10000     13000.0

In [ ]:
df['Name_length']=df['Emp_name'].apply(len)
print(df)

   Dept Emp_name  Salary  New_Salary  Name_length
0     1     raju    1111      1667.0            4
1     2     kanu    2222      3333.0            4
2     3     seju    3333      4333.0            4
3     4     papu    4444      5778.0            4
4     5    sanju    5555      7222.0            5
5     6     salu    6666      8666.0            4
6     7     ashu    7777     10111.0            4
7     8   akshay    8888     11555.0            6
8     9     monu    9999     12999.0            4
9    10     motu   10000     13000.0            4

In [ ]:
df['New_Salary'].apply(lambda x:np.sqrt(x))

0     40.828911
1     57.732140
2     65.825527
3     76.013157
4     84.982351
5     93.091353
6    100.553468
7    107.494186
8    114.013157
9    114.017543
Name: New_Salary, dtype: float64

In [ ]:
print("\nsum of the column 'New_Salary' is: ",df['New_Salary'].sum())

sum of the column 'New_Salary' is:  78664.0

In [ ]:
print("\nsum of the column 'New_Salary' are: ",df['New_Salary'].min(),"and",df['New_Salary'].max())

sum of the column 'New_Salary' are:  1667.0 and 13000.0

In [ ]:
print("\nName of columns\n",'_'*20,sep='')
print(df.columns)

Name of columns
____________________
Index(['Dept', 'Emp_name', 'Salary', 'New_Salary', 'Name_length'], dtype='object')

FINDING NULL VALUE

In [ ]:
df=pd.DataFrame({'name':['ramesh','raghav',np.nan,np.nan],
                'gender':[np.nan,'M','M','F'],
                'section':['a','b','c','d'],
                'class':[5,12,np.nan,np.nan],
                'phone number':[np.nan,np.nan,12345678,8745612],
                'location':['india','bangaluru',np.nan,'gujarat'],
                'email':['a','b',np.nan,np.nan],
                'door number':[111,555,np.nan,np.nan],
                'street_name':['abc','def','ghi','jkl'],
                'pin code':[5,75,np.nan,np.nan],
                'state':[np.nan,'xyz','ghi',np.nan],
                'dad name':['dfg','sdf',np.nan,'cfy']},dtype=int)
df

C:\Users\paksh\AppData\Local\Temp\ipykernel_6276\1911526817.py:1: FutureWarning: Could not cast to int32, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame({'name':['ramesh','raghav',np.nan,np.nan],

,name,gender,section,class,phone number,location,email,door number,street_name,pin code,state,dad name
0,ramesh,NaN,a,5,NaN,india,a,111,abc,5,NaN,dfg
1,raghav,M,b,12,NaN,bangaluru,b,555,def,75,xyz,sdf
2,NaN,M,c,NaN,12345678,NaN,NaN,NaN,ghi,NaN,ghi,NaN
3,NaN,F,d,NaN,8745612,gujarat,NaN,NaN,jkl,NaN,NaN,cfy

In [ ]:
df.isnull().sum()

name            2
gender          1
section         0
class           2
phone number    2
location        1
email           2
door number     2
street_name     0
pin code        2
state           2
dad name        1
dtype: int64

CSV FILE CRATE

In [ ]:
import pandas as pd
#df=pd.read_csv("c:\myfolder\empl.csv")

df=pd.read_csv("empl.csv")
print(df)

     male  101  45
0  female  102  67
1    male  103  98
2  female  104  52
3    male  105  85

DATA CLEANING

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
vall=np.array([1,np.nan,7,1,8])
vall

array([ 1., nan,  7.,  1.,  8.])

In [ ]:
6+np.nan

nan

In [ ]:
7*np.nan

nan

In [ ]:
np.nansum(vall)

17.0

NAN AND NONE IN PANDAS

In [ ]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

CREATE DATAFRAME WITH MISSING VALUES

In [ ]:
raw_data={'first name':['ina',np.nan,'mina','tina','amy','madhu'],
         'last name':['miller',np.nan,'ali','milner','cooze','patil'],
         'age':[42,np.nan,49,78,96,15],
         'sex':['M',np.nan,'F','M','F','F'],
         'unit 1':[4,np.nan,np.nan,8,9,4],
         'umit 2':[3,np.nan,8,5,2,4]}
df=pd.DataFrame(raw_data,columns=['first name','last name','age','sex','unit 1','unit 2'])
df

  first name last name   age  sex  unit 1 unit 2
0        ina    miller  42.0    M     4.0    NaN
1        NaN       NaN   NaN  NaN     NaN    NaN
2       mina       ali  49.0    F     NaN    NaN
3       tina    milner  78.0    M     8.0    NaN
4        amy     cooze  96.0    F     9.0    NaN
5      madhu     patil  15.0    F     4.0    NaN

DROP MISSING OBESRVATION

In [ ]:
df_no_missing=df.dropna()
df_no_missing

Empty DataFrame
Columns: [first name, last name, age, sex, unit 1, unit 2]
Index: []

In [ ]:
df

  first name last name   age  sex  unit 1 unit 2
0        ina    miller  42.0    M     4.0    NaN
1        NaN       NaN   NaN  NaN     NaN    NaN
2       mina       ali  49.0    F     NaN    NaN
3       tina    milner  78.0    M     8.0    NaN
4        amy     cooze  96.0    F     9.0    NaN
5      madhu     patil  15.0    F     4.0    NaN

In [ ]:
df_cleand=df.dropna(how='all')
df_cleand

  first name last name   age sex  unit 1 unit 2
0        ina    miller  42.0   M     4.0    NaN
2       mina       ali  49.0   F     NaN    NaN
3       tina    milner  78.0   M     8.0    NaN
4        amy     cooze  96.0   F     9.0    NaN
5      madhu     patil  15.0   F     4.0    NaN

In [ ]:
df['final score']=np.nan
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df.dropna(axis=1,how='all')
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df.fillna(0)

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,0.0,0.0,Ahmedabad,0.0
1,ina,miller,42.0,M,6.25,0.0,0.0,Ahmedabad,0.0
2,mina,ali,49.0,F,6.25,0.0,0.0,Ahmedabad,0.0
3,tina,milner,78.0,M,8.00,0.0,0.0,Ahmedabad,0.0
4,amy,cooze,96.0,F,9.00,0.0,0.0,Ahmedabad,0.0
5,madhu,patil,15.0,F,4.00,0.0,0.0,Ahmedabad,0.0

In [ ]:
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df["unit 1"].fillna(df["unit 1"].mean(),inplace=True)
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
 df["unit 2"].fillna(df.groupby("sex")["unit 2"].transform("mean"),inplace=True)
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df[df['age'].notnull() & df['sex'].notnull()]

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df.fillna(method='bfill')

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

In [ ]:
df.fillna(method='ffill',inplace=True)

In [ ]:
df

,first name,last name,age,sex,unit 1,unit 2,final; score,location,final score
0,ina,miller,42.0,M,4.00,NaN,NaN,Ahmedabad,NaN
1,ina,miller,42.0,M,6.25,NaN,NaN,Ahmedabad,NaN
2,mina,ali,49.0,F,6.25,NaN,NaN,Ahmedabad,NaN
3,tina,milner,78.0,M,8.00,NaN,NaN,Ahmedabad,NaN
4,amy,cooze,96.0,F,9.00,NaN,NaN,Ahmedabad,NaN
5,madhu,patil,15.0,F,4.00,NaN,NaN,Ahmedabad,NaN

SERIES MANIUPLATION

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
ser1=pd.Series(data=[1,2,3,4],index=['ca','or','co','az'])
ser2=pd.Series([1,2,5,4],['ca','or','nv','az'])

In [ ]:
ser2

ca    1
or    2
nv    5
az    4
dtype: int64

In [ ]:
ser1

ca    1
or    2
co    3
az    4
dtype: int64

In [ ]:
print("\nindexing by name of the item/object (string identifier)\n",'_'*56,sep='')
print('value for ca in ser1:',ser1['ca'])
print('value for az in ser1:',ser1['az'])
print('value for nv in ser2:',ser2['nv'])

indexing by name of the item/object (string identifier)
________________________________________________________
value for ca in ser1: 1
value for az in ser1: 4
value for nv in ser2: 5

In [ ]:
print("\nindexing by name of the item/object (string identifier)\n",'_'*56,sep='')
print('value for ca in ser1:',ser1[0])
print('value for az in ser1:',ser1[3])
print('value for nv in ser2:',ser2[2])

indexing by name of the item/object (string identifier)
________________________________________________________
value for ca in ser1: 1
value for az in ser1: 4
value for nv in ser2: 5

In [ ]:
print("\nindexing by range\n"'_'*25,sep='')
print("value for or,co and az in ser1:\n",ser1[1:4],sep='')

indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
indexing by range
_
value for or,co and az in ser1:
or    2
co    3
az    4
dtype: int64

In [ ]:
ser1=pd.Series([1,2,3,4,10],['ca','or','co','az','nv'])
ser2=pd.Series([1,2,5,4,30],['ca','or','nv','pa','co'])
ser3=ser1+ser2

In [ ]:
print("\nafter adding the two series,the result looks like thus...\n",'_'*59,sep='')
print(ser3)
print("\npython tries to add values where it finds common index name,and keeps NAN where indices are missing\n")

after adding the two series,the result looks like thus...
___________________________________________________________
az     NaN
ca     2.0
co    33.0
nv    15.0
or     4.0
pa     NaN
dtype: float64

python tries to add values where it finds common index name,and keeps NAN where indices are missing

DATAFRAME MANIPULATION

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
matrix_data=np.matrix('22,66,140;70,148,52;65,89,56;96,63,56;25,89,12')
row_labels=['raju','hame','sada','gum','kiya']
column_headings=['age','hight','weight']

In [ ]:
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)
print("\nA new DataFrame\n",'_'*25,sep='')
print(df)

A new DataFrame
_________________________
      age  hight  weight
raju   22     66     140
hame   70    148      52
sada   65     89      56
gum    96     63      56
kiya   25     89      12

In [ ]:
print("\nthe 'hight'column\n",'_'*25,sep='')
print(df['hight'])

the 'hight'column
_________________________
raju     66
hame    148
sada     89
gum      63
kiya     89
Name: hight, dtype: int32

In [ ]:
df.loc['raju']

age        22
hight      66
weight    140
Name: raju, dtype: int32

In [ ]:
df.iloc[0]

age        22
hight      66
weight    140
Name: raju, dtype: int32

In [ ]:
print(df)
print("\nselect index and column for perticular data\n")
print(df.loc['hame','hight'])

      age  hight  weight
raju   22     66     140
hame   70    148      52
sada   65     89      56
gum    96     63      56
kiya   25     89      12

select index and column for perticular data

148

In [ ]:
print("\nrows with hight>65 inch\n",'_'*35,sep='')
print(df[df['hight']>65])

rows with hight>65 inch
___________________________________
      age  hight  weight
raju   22     66     140
hame   70    148      52
sada   65     89      56
kiya   25     89      12

In [ ]:
booldf1=df['hight']>65
booldf2=df['weight']>145

In [ ]:
print(df[(booldf1) & (booldf2)])

Empty DataFrame
Columns: [age, hight, weight]
Index: []

In [ ]:
print("\nrows with age < 35 year \n",'_'*35,sep='')
df=(df[df['age']<35])
print (df)

rows with age < 35 year
___________________________________
      age  hight  weight
raju   22     66     140
kiya   25     89      12

In [ ]:
print("\nafter resetting index with  option \n",'_'*45,sep='')
print(df.reset_index)

after resetting index with  option
_____________________________________________
<bound method DataFrame.reset_index of       age  hight  weight
raju   22     66     140
kiya   25     89      12>

DATE TIME MANIPULATION

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
date_range = pd.date_range('4/12/2021', periods=6)

dates = pd.DataFrame(date_range,columns=['date'])
dates

        date
0 2021-04-12
1 2021-04-13
2 2021-04-14
3 2021-04-15
4 2021-04-16
5 2021-04-17

In [ ]:
dates['day'] = dates['date'].dt.day
dates['month'] = dates['date'].dt.month
dates['year'] = dates['date'].dt.year
dates

        date  day  month  year
0 2011-04-12   12      4  2011
1 2011-04-13   13      4  2011
2 2011-04-14   14      4  2011
3 2011-04-15   15      4  2011
4 2011-04-16   16      4  2011
5 2011-04-17   17      4  2011

In [ ]:
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7),index=dates)
print(ts)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [ ]:
import csv
with open('age.salary.csv', newline='') as f:
    reader = csv.reader(f)
    for row in reader:
        print(row)

['index\tNation\tpurchased_item\tsalary\tage']
['0\tIndia\tNo\t66777\t23']
['1\tRussia\tYes\t87878\t24']
['2\tGermany\tNo\t34559\tNaN']
['3\tIndia\tYes\t40000\t26']
['4\tGermany\tYes\tNaN\t21']
['5\tRussia\tNo\t45000\tNaN']
['6\tGermany\tYes\t89993\t62']
['7\tIndia\tNo\t55555\t24']
['8\tRussia\tYes\tNaN\t45']

In [ ]:
import csv
with open('empl.csv', newline='') as f:
    reader = csv.reader(f)
    for row in reader:
        print(row)

['male', '101', '45']
['female', '102', '67']
['male', '103', '98']
['female', '104', '52']
['male', '105', '85']